#include<stdio.h>
int number[6][32] = {{1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63},
                     {2, 3, 6, 7, 10, 11, 14, 15, 18, 19, 22, 23, 26, 27, 30, 31, 34, 35, 38, 39, 42, 43, 46, 47, 50, 51, 58, 59, 62, 63},
                     {4, 5, 6, 7, 12, 13, 14, 15, 20, 21, 22, 23, 28, 29, 30, 31, 36, 37, 38, 39, 44, 45, 46, 47, 52, 53, 54, 55, 60, 61, 62, 63},
                     {8, 9, 10, 11, 12, 13, 14, 15, 24, 25, 26, 27, 28, 29, 30, 31, 40, 41, 42, 43, 44, 45, 46, 47, 56, 57, 58, 59, 60, 61, 62, 63},
                     {16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63},
                     {32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63}};
int main()
{
    int search(int,int);
    int a[6],i=0,signal=0;
    while(scanf("%d",&a[i])==1&&a[i]!=0)//输入部分，输入0停止，将输入数据存入数组中
    {
        i++;
    }
    for(int j=0;j<=31;j++)//默认以a[0]行元素为标准，之后逐行比对
    {
        int k;
        for(k=1;k<=i-1;k++)//循环对a[k]行查找
        {
            if(search(a[k],number[a[0]-1][j])==0) break;//如果a[k]行没有就跳过
        }
        if(k==i) //k==i说明之前没有跳过，代表每一行都有
        {
            signal=1;
            printf("%d\n",number[a[0]-1][j]);
            return 0;//如要找到所有相同的数，将这一行删去
        }
    }
    /*if(signal==0)
    printf("There is no number in these lines.\n");//如要找到所有则将这个语句段填入
    return 0;*/
}
int search(int line,int num)
{
    for(int i=0;i<=31;i++)
    {
        if(number[line-1][i]==num) return 1;
    }
    return 0;
}